[
  "My husband is like Math, can't be contradicted.",
  "Whatever women do they must do twice as well as men to be thought half as good. Luckily, this is not difficult.",
  "Common sense is the collection of prejudices acquired by age eighteen.",
  "Everyone is born equal in life, until they get married.",
  "Lead us not into temptation. Just tell us where it is; we'll find it.",
  "I once finished first on my running team, then the coach asked me where everyone else is.",
  "Thus the metric system did not really catch on in the States, unless you count the increasing popularity of the nine-millimeter bullet.",
  "We've tripled the amount of money - I believe it's from $50 million up to $195 million available.",
  "Outside of a dog, a book is man's best friend. Inside of a dog it's too dark to read.",
  "How is a poor man a lot like a rich man?  They both have an iPhone.",
  "Our toaster has two settings: too soon or too late.",
  "Always have something beautiful in sight, even if it's only a poster on a wall.",
  "The first person who decided to say a word instead of throwing a rock can be considered the starter of civilization.",
  "Whomever tries to drown their sorrows by drinking should know one thing: they know how to swim!",
  "It takes 46 muscles to frown but only 4 to flip 'em the bird.",
  "If you're all wrapped up in yourself then you are overdressed.",
  "What is the difference between having a cold beer and going to the bathroom? About 35 minutes.",
  "You can teach a cat to do anything that it wants to do.",
  "When inspiration does not come to me, I go halfway to meet it.",
  "Marge, don't discourage the boy.  Weaseling out of things is important to learn.  It's what separates us from the animals!... Except the weasels. - Homer Simpson",
  "It's better to shut up and give the impression that you're stupid than to say something and erase all doubt.",
  "The most important thing in life is not knowing everything, it's having the phone number of somebody who does!",
  "I called the restaurant and I asked them if they take orders, when they said they do, I told them 'run outside naked!'",
  "My advice is to never listen to any advice, not even this one.",
  "For the best seat in the house, you'll have to move the dog.",
  "Alcohol, what's that? It's not in my vodkabulary, but let me check in whiskypedia.",
  "I put my phone in airplane mode, but it's not flying!",
  "I believe there should be a better way to start each day... instead of waking up every morning.",
  "Friends come and go, but enemies remain and build up.",
  "One day my wife's credit card got stolen.. what a relief it was to find that the thief spends less than my wife!",
  "If you want someone who will listen to you every time, do everything you tell them to do, and always be there for you for better or for worse, get a dog.",
  "If you know how many cupcakes I'm holding behind my back I'll give you both of them.",
  "A zooology teacher asks the class 'What is the one animal in the jungle that a lion is afraid of?' The class answers: a lioness.",
  "I'm not suffering from insanity, I'm enjoying every minute of it.",
  "You're born free, then you're taxed to death.",
  "I look at the moon and it looks really beautiful!.. Then I look at you... and.. I think I'll look at the moon again?!",
  "I told the doctor I broke my leg in two places. He told me to quit going to those places.",
  "You come into the world with nothing, and the purpose of your life is to make something out of nothing.",
  "God heals, and the doctor takes the fees.",
  "You can't have everything... where would you put it?",
  "Man came down from the tree, then he cut the tree down.",
  "I think I like something, but I'm not sure what?",
  "I hope I didn't brain my damage... - Homer Simpson",
  "I just ate some garlic, so I can't talk.",
  "What do you get when you cross the Godfather with a lawyer?An offer you can't understand.",
  "You can't make a circle of friends with a compass.",
  "A good dog is a bad dog.",
  "Agitator: A politician who shakes the fruit trees of his neighbors to rid them of worms.",
  "The household cat is really a tiger that has underwent three counselling programs.",
  "When you meet the right woman she will sink into your arms, then your arms in her sink.",
  "Quoting: the act of repeating erroneously the words of another.",
  "It's 11PM, do you know where your pants are?",
  "If you want to change your life, insert a coin in a change machine.",
  "In olden times, sacrifices were made at the altar, a practice which is still very much practiced.",
  "Enjoy your life thoroughly, the same way you wash your clothes.",
  "I think animal testing is a terrible idea; they get all nervous and give the wrong answers.",
  "Think about it for a second: You are what you eat, so do you really want to eat junk food?",
  "A penny saved is ridiculous.",
  "Car for sale only $200! Four doors, windows and tires ALL included!  FREE air inside tires and full headlight fluid.  Clean title - nothing ever spilled on it even once!  Own this car today and get an INSTANT rebate, $0.14 cents in change left in the glove box.",
  "Gasoline is getting more expensive because transporting it costs more when it gets more expensive.",
  "My friend, remember that without stupidity there wouldn't be intelligence, and without ugliness there wouldn't be beauty, so the world needs you after all.",
  "The alphabet begins with ABC, numbers begin with 123, music begins with do-re-mi, and friendship begins with you and me.",
  "I don't smoke, don't drink, don't do drugs, I only have one small problem, I lie.",
  "Today I saw something through a store window that was truly stunning, beautiful and sexy.  I wanted to get it for you, but then I realized it's my own reflection!",
  "I'm old enough to know better, but young enough to do it anyway.",
  "Cell phones these days keep getting thinner and smarter... people the opposite.",
  "The future is shaped by your dreams, so stop wasting time and go to sleep!",
  "The road to success is always under construction.",
  "When a couple is arguing over who loves who more, the one that gives up is the real winner.",
  "A lie gets halfway around the world before the truth has a chance to get its pants on.",
  "My wife told me the other day that I don't take her to expensive places any more, so I took her to the gas station.",
  "If we were on a sinking ship, and there was only one life vest... I would miss you so much.",
  "I'm sorry that I'm not updating my Facebook status, my cat ate my mouse.",
  "I am on a seafood diet.  I see food, and I eat it.",
  "You can only be young once. But you can always be immature.",
  "I love being married. It's so great to find that one special person you want to annoy for the rest of your life.",
  "All you need is love. But a little chocolate now and then doesn't hurt.",
  "I am too lazy to be lazy.",
  "The best revenge is massive success.",
  "A good speech should be like a woman's skirt: long enough to cover the subject and short enough to create interest.",
  "In America, it is not important how much an item costs, it's more important how much you can save when you buy it.",
  "The other day when I was walking through the woods, I saw a rabbit standing in front of a candle making shadows of people on a tree.",
  "One small decision can change your life! That's why I always let someone else make my decisions, that way if something goes wrong I have somebody to blame other than myself.",
  "Could you please be as silent as the G in lasagna?",
  "You know when you put a stick in water and it looks bent? That's why I never take baths.",
  "Bathroom sign above toilet:  It's like basketball, the basket is bigger than the ball!  Learn to score properly!",
  "You laugh because I'm different...........\nI laugh cause I just farted!",
  "What is the one machine at your local gym you should use to impress the ladies? The bank machine.",
  "How do you know a man is thinking about his future?  He buys two cases of beer instead of one.",
  "I can win an argument on any topic, against any opponent. People know this, and steer clear of me at parties. Often, as a sign of their great respect, they don't even invite me.",
  "I'll do the stupid thing first and then you shy people follow .",
  "I am on a 20 day diet, so far I've lost 10 days.",
  "Finding a treasure is like working on algebra equations, all you have to do is find the X.",
  "If you can't find your better half, try finding your better two quarters.",
  "Love is like playing bridge, if you don't have a good partner, it's good to at least have a good hand.",
  "Don't believe everything fortune cookies tells you.  Just because they're sweet doesn't mean they're right.",
  "Luckiness top moment: To get run over by an ambulance.",
  "It's not true that I had nothing on. I had the radio on.",
  "Never stand between a dog and the fire hydrant.",
  "Have no fear of perfection, you'll never reach it.",
  "Beer is proof God Loves us and wants us to be happy.",
  "If you live in a school, then you're probably a fish.",
  "I could've eaten Alphabits and crapped out a better essay!!",
  "See, I got this friend named.. Joey Jo-Jo...Junior...Shabadoo - Homer Simpson",
  "A meeting is an event at which the minutes are kept and the hours are lost.",
  "Technological progress is like putting an axe in the hands of a pathological criminal.",
  "Sleeping on my keyboard.  If I answer, I'm talking in my sleep.",
  "Wear short sleeves! Support your right to bare arms!",
  "What do Eskimos get from sitting on the ice too long?Polaroids.",
  "I'm fast, great and unstoppable!  You're a train??",
  "If only God would give me some clear sign! Like making a large deposit in my name at a Swiss Bank.",
  "The only way to know if the glass is half empty or half full is to measure it really accurately, like with a laser.",
  "Car service: If it ain't broke, we'll break it.",
  "This e-book is terrible, I'm going to burn it!  I mean delete it...",
  "Autumn is a season followed immediately by looking forward to spring.",
  "I'm copying, my friend is copying, everyone is copying each other,... so what time is it?  Exam time!",
  "Is it good if a blow dryer blows?",
  "Playing the stock market is very similar to playing the lottery, except you actually win sometimes at the lottery.",
  "Bart! With ten thousand dollars, we'd be millionaires!  We could buy all kinds of useful things like... love!",
  "Our bombs are smarter than the average high school student. At least they can find Kuwait.",
  "The average woman would rather have beauty than brains, because the average man can see better than he can think.",
  "I love making friends. I usually prefer to make them out of plaster and give them funny looking hats.",
  "If A is success in life, then A is equal to X plus Y plus Z.  Work is X;  Y is play;  and Z - keeping your mouth shut.",
  "There is a fine line between fishing and just standing on the shore like an idiot.",
  "The only English words I saw in Japan were Sony and Mitsubishi.",
  "When you are courting a nice girl an hour seems like a second. When you sit on a red-hot cinder a second seems like an hour. That's relativity.",
  "Sometimes you succeed.... and other times you learn.",
  "It's easy to identify people who can't count to ten. They're in front of you in the supermarket express lane.",
  "Happiness: The emotion that puts your face in motion.  Fear: The emotion that puts your legs in motion.   Anger: The emotion that puts your fist in motion.  Lesson: Don't be afraid or angry and you won't have to run and fight.",
  "The only reason people get lost in thought is because it's unfamiliar territory.",
  "Christmas is a competition between who gives up first: Your feet or your wallet.",
  "Sharks are not so bad... If a stranger came into my house wearing only a bathing suit, I'd probably get angry too.",
  "If you think patience is a virtue, try surfing the net without high speed Internet.",
  "Always run away from temptations... but slowly, so they can catch up to you.",
  "Living on earth may be tough, but it includes a free ride around the sun every year.",
  "I lost control.  Offering reward to anyone who finds it.",
  "The world today doesn't make sense, so why should I paint pictures that do?",
  "Alcohol kills brain cells slowly, but that never bothered me because I'm not in a hurry.",
  "When I saw the monkeys at the zoo it reminded me of watching political debates on TV.",
  "After twelve years of therapy my psychiatrist said something that brought tears to my eyes. He said, \"No hablo ingles.\"",
  "Ladies and gentlemen thank you for flying xyz airlines, we hope you enjoyed your flight as much as we enjoyed taking your money.  Please remember to take all your belongings. Anything left behind will be distributed evenly among crew members.",
  "Actual meanings of various terms:TEAM WORK: Having somebody else you can blame it on.\nHARDWARE: The part of a computer you can kick when there are software problems.\nIMPATIENT: Somebody who is waiting in a hurry.\nINFLATION: Paying today's prices with last year's salary.",
  "Everyone is entitled to their own opinion. It's just that yours is stupid.",
  "A bald spot is like a lie, the bigger it gets the harder it is to cover it up.",
  "Don't disturb me, I am disturbed enough already.",
  "I love my computer because all my friends live inside it!",
  "A fisherman who just caught a huge salmon reels the fish in, looks at the fish and says 'I am taking you for tonight's dinner!' The fish replies 'I already ate, can we go somewhere else?'",
  "After many years of studying my Geography book I finally know by heart that Australia is on page 23.",
  "Marriage is the bond between a person who never remembers anniversaries and another who never forgets them.",
  "Whether it's the best of times or the worst of times, it's the only time we've got.",
  "God loved the birds and invented trees. Man loved the birds and invented cages.",
  "Men are like bank accounts.\nWithout a lot of money they don't generate a lot of interest.",
  "A bikini is like a barbed wire fence. It protects the property without obstructing the view.",
  "Isn't it a bit unnerving that doctors call what they do 'practice' ?",
  "Two fleas are coming out of a bar when one asks the other 'Do we take a dog or do we walk home?'",
  "Everyone has photographic memory; some just don't have the film.",
  "Don't ask me anything, and I won't tell you any lies.",
  "I was always taught to respect my elders and I've now reached the age when I don't have anybody to respect.",
  "I never made a mistake in my life. I thought I did once, but I was wrong.",
  "I'm not afraid to die.  I just don't like the thought of being gone so long!",
  "Why don't snails run?  Because their eyes go wobbly.",
  "If all misfortunes were laid in one common heap whence everyone must take an equal portion, most people would be contented to take their own and depart.",
  "Some people go to the office in a Hyundai, some in a Ferrari, my office *is* a Boeing 747.",
  "If you have $20 and Chuck Norris has $5, he has more money than you.\nWhen Chuck Norris plays monopoly the entire world's economy is shaken.\nChuck Norris can sneeze with his eyes open.\nChuck Norris managed to count to infinity.. twice!\nWhen Chuck does push-ups he doesn't move, the earth moves.",
  "Is it hot in here, or is it just the fireplace?",
  "There is something about the outside of a horse that is good for the inside of a man.",
  "Why does the computer programmer ignore the warning on the cigarette carton?  Because he's seen so many warnings he only cares about errors.",
  "What time zone are you in when you're at the North Pole?  All of them!  In fact, you can just pick any time zone you prefer!",
  "I just bought a microwave fireplace. You can spend an evening in front of it in only eight minutes.",
  "What's the difference between an electric locomotive and a steam one?  The electric locomotive stopped smoking.",
  "This is a quantum car. I don't know where I am, but I'm going really fast.",
  "The most important thing about writing a book is having book parties.",
  "I'm the literary equivalent of a big mac and fries.",
  "Fall is the spring of winter.",
  "How does a network administrator nerd greet people who come to his house?  Welcome to 127.0.0.1.",
  "Is the chemical aftertaste the reason why people eat hot dogs, or is it some kind of bonus?",
  "My wife told me we have to separate, the whites from the darks.",
  "When I first heard that Marge was joining the police academy, I thought it would be fun and zany, like that movie... Spaceballs.  But instead it was dark and disturbing,  like that movie... Police Academy.",
  "It's time for the human race to enter the solar system.",
  "How do you get a Kleenex to dance?Put a little boogy in it!",
  "The secret of success is to go from mistake to mistake without losing your enthusiasm.",
  "In Math class we learned more about algebra today, such as X+10=Y should I care?",
  "Your bank account can be overdrawn, but it can never be overfilled.",
  "I'd like to live like a poor man - only with lots of money.",
  "There was a time when people said, 'Jim, if you keep on making faces, your face will freeze like that.' Now they just say, 'Pay him!'",
  "Why does the bad piano player refuse to play when you offer him $100 to play?  The neighbour already gave him $200 to stop playing.",
  "Friendship is like peeing on yourself: everyone can see it, but only you get the warm feeling that it brings.",
  "He's so lazy that if there were work in bed, he would rather sleep on the floor.",
  "I told my wife that a husband is like a fine wine; he gets better with age. The next day, she locked me in the cellar.",
  "I fear one day I'll meet God, he'll sneeze and I won't know what to say.",
  "Not all chemicals are bad.  Without chemicals such as hydrogen and oxygen for example, there would be no way to make water, a vital ingredient in beer.",
  "It doesn't make a difference what temperature a room is, it's always room temperature.",
  "It takes only one drink to get me drunk. The trouble is, I can't remember if it's the thirteenth or the fourteenth.",
  "Being angry is not necessarily bad, some the best things were invented by angry people.  Lamborghini didn't produce a single car until Enzo Ferrari made him angry.",
  "My neighbour asked if he could use my lawnmower and I told him of course he could, so long as he didn't take it out of my garden.",
  "A few days ago I lost my weapon of Math instruction... my trusty pocket calculator.",
  "I'm not frowning, I'm just smiling upside down.",
  "Everyone wants your best! Don't let them take it away from you.",
  "The most important four words for a successful marriage: 'I'll do the dishes.'",
  "Two mice are eating a movie film roll at a cinema when one says to the other: this movie is good, but the book was better!",
  "If aliens saw us walking our dogs and picking up their poop, who would they think is in charge?",
  "Ever since it started snowing my husband is standing in front of the window and watching.  If the snow gets much worse, I might let him inside the house.",
  "The difference between stupidity and genius is that genius has its limits.",
  "Me: For the first time in life, things seem to be getting better. :)\nLife: LOL, give me a second!",
  "Love your enemies.  It makes them so damned mad.",
  "Any man who can drive safely while kissing a pretty girl is simply not giving the kiss the attention it deserves.",
  "A celebrity is a person who works hard all his life to become well known, then wears dark glasses to avoid being recognized.",
  "Smile today, tomorrow could be worse.",
  "I know that I am stupid but when I look around me I feel a lot better.",
  "To make a mistake is human, but to blame it on someone else, that's even more human.",
  "Insanity: doing the same thing over and over again and expecting different results.",
  "When you see a couple walking down the street holding hands and laughing, you look over to your side and the only thing you're holding is a half eaten sandwich.",
  "Never take life seriously. Nobody gets out alive anyway.",
  "Why cry for someone when you can laugh next to someone else?",
  "Give me a photo of you so I can show Santa what I want for Christmas.",
  "You know the oxygen masks on airplanes? I don't think there's really any oxygen.  I think\nthey're just to muffle the screams.",
  "Tell your boss what you really think about him, and the truth shall set you free, from your job.",
  "Some of the greatest ideas of all time have come to people during Math class... none of which had anything to do with Math.",
  "I love my job only when I'm on vacation.",
  "The problem with drinking and driving is that trees defend themselves very well.",
  "In God we trust; all others must pay cash.",
  "Everyone has a purpose in life. Perhaps yours is watching television.",
  "I think it's wrong that only one company makes the game Monopoly.",
  "I like life. It's something to do.",
  "I can't wait for that to never happen.",
  "Chuck Norris is so amazing he can:\nLight ants on fire with a magnifying glass.  At night.\nDisarm five criminals in five seconds.  With one hand.\nSlam a revolving door.\nMake the boogie man scared.\nClap with one hand.",
  "Some people call me Mike, you can call me tonight.",
  "If you're always busy busy busy, you can't enjoy enjoy enjoy your life.",
  "Why did the blonde send a blank letter to her husband in the army?  They had a fight before he left and they're not talking.",
  "The hardest thing in the world to understand is the income tax.",
  "That's the secret to life... replace one worry with another....",
  "Every time I walk out of Math class I want to cry.  Now I have to go fail my Math exam, be back in 2 hours.",
  "Money doesn't make you happy. I now have $50 million but I was just as happy when I had $48 million.",
  "If we don't succeed, we run the risk of failure.",
  "Chuck Norris sleeps with a night light on, not because he's afraid of the dark, but because the dark is afraid of him.",
  "Why did the blonde take two stones to bed? One to hit the light switch and turn the light off and the other to check if the window is closed.",
  "Why does Chuck Norris' calendar go directly from March 31 to April 2nd?  Nobody fools Chuck Norris!",
  "I slipped on a banana peel and I fell in love with the person who helped me up.",
  "I know how to live my life to the fullest.. but let's speak later after I finish playing some computer games.",
  "The future is not what it once used to be...",
  "I know that I am intelligent, because I know that I know nothing.",
  "The hardest thing to find in life is happiness - money is only hard to find because it gets wasted trying to find happiness.",
  "Two things are infinite: the universe and human stupidity; and I'm not sure about the universe.",
  "In beer there is freedom, in wine there is health, in cognac there is power and in water there is bacteria.",
  "Whoever said great things come in small packages hasn't seen my big screen TV.",
  "I look to the future because that's where I'm going to spend the rest of my life.",
  "Silence is golden.  Too bad nobody is buying.",
  "Life is like a very long TV show, without a remote control.",
  "Never under any circumstances take a sleeping pill and a laxative on the same night.",
  "Those who snore always fall asleep first.",
  "The best things in life are free.  The rest are too expensive.",
  "Last night I lay in bed looking up at the stars in the sky and I thought to myself, where the heck is the ceiling?",
  "A good friend is like a bra: hard to find one you're comfortable with, always provides support, holds you tight and is always close to your heart.",
  "The probability of meeting someone you know increases a hundredfold when you're with someone you're not supposed to be seen with.",
  "All of us light up a room, some when they enter, others when they leave.",
  "There's life without Facebook and Internet? Really?  Send me the link.",
  "For 2014 I wish you 12 months of happiness, 52 weeks of fun, 365 days of success, 8760 hours of great health and 525600 lucky minutes! Happy New Year!",
  "To make time fly, throw your watch out the window.",
  "If you want your wife to listen to you, then talk to another woman; she will be all ears.",
  "I'm in desperate need of a 6 month vacation... twice a year.",
  "What did my doctor tell me when I rushed into his office and told him I have 40 seconds to live? Hold on a minute!",
  "In grammar class the teacher asks her student 'When you sing you say 'I sing' what do you say when your brother is singing? I say 'shut up you're a terrible singer'.",
  "Laughing is one of the best exercises, it's like running inside your mind.  You can do it almost anywhere and it's even better with a friend.",
  "A balanced diet means a cupcake in each hand.",
  "If you think nothing is impossible, try slamming a revolving door.",
  "I looked into my wallet and it was empty, I looked through all my pockets and they were all empty. Then I looked into my heart and I found you, and only then I figured out how rich I was.",
  "Coincidence is God's way of remaining anonymous.",
  "Yesterday I did nothing and today I'm finishing what I did yesterday.",
  "Sometimes when I close my eyes, I can't see.",
  "When you have a hammer in your hand everything around you starts looking like a nail.",
  "Google earth view gives you the amazing chance to see amazing places all over the world, from the comfort of your own home.  With this amazing privilege, what do most people look at?  Their own house, their friends houses, and mostly places they have already been to!",
  "Stop worrying about the world ending today. It's already tomorrow in Australia.",
  "I always dream of being a millionaire like my uncle!...  He's dreaming too.",
  "Long time ago I used to have a life, until someone told me to create a Facebook account.",
  "To the guy who created imaginary numbers in Math: I hate you.",
  "Dogs feel very strongly that they should always go with you in the car, in case the need should arise for them to bark violently at nothing, right in your ear.",
  "Life is not about how you survive the storm, it's about how you dance in the rain.",
  "You know your driving is really terrible when your GPS says 'After 300 feet, stop and let me out!'",
  "Diet rule #1: If nobody sees you eating it, it doesn't contain any calories.",
  "A girl called me once and said \"come over, nobody is home!\"  I went there and she was right, nobody was home!",
  "Newspaper ad: Hiring clowns, must be serious.",
  "What if everything is an illusion and nothing exists? In that case, I definitely overpaid for my carpet.",
  "What does a homeless person do the first time you let them use a computer?  Searches through the recycle bin.",
  "The human race is faced with a cruel choice: work or daytime television.",
  "Life is the dash between the birth date and the passed away date.",
  "Oh, what a tangled web do parents weave when they think that their children are naive.",
  "Friends are chocolate chips in the cookie of life!",
  "Constantly choosing the lesser of two evils is still choosing evil.",
  "I feel the best when I am happy.",
  "Never moon a werewolf.",
  "I don't care when people honk at me, but when geese do, I get out of the way!",
  "Buy our alarm clock and you will sleep soundly.",
  "Flying is learning how to throw yourself at the ground and miss.",
  "Never run away when you see a bear, unless you know you can beat some of the other runners.",
  "We have to do the impossible, but it is possible.",
  "'Press any key to continue, where's the any key?' - Homer Simpson",
  "Why is it called 'after dark' when it really is 'after light'?",
  "Dreaming permits each and every one of us to be quietly and safely insane every night of our lives.",
  "Chuck Norris has a bear carpet in his house, the bear isn't dead its just afraid to move.",
  "Stop the earth from spinning, I want to get off!",
  "Beginner pilot rules:\n1. The propeller is just a big fan made to cool down the pilot in the cockpit.  When it stops, you can see the pilot start sweating excessively.\n2. You don't have to take off, but landing is mandatory.\n3. Pushing forward on the flight stick makes the earth look bigger, pulling makes it look smaller.\nIf you pull too much or too long however, it will look bigger yet again.\n4. Flying is safe as long as you don't crash.\n5. It's better to wish you were flying than to wish you were on the ground.\n6. A good landing is a landing in which everyone walks away.\n7. Besides affecting apples, gravity also affects planes.",
  "Life is a pretty cheezy game, but at least it has good graphics.",
  "Whatever it is -- I didn't do it!",
  "My wife loves me so much, she tries her best to attract me to her.  The other day she put on a perfume that smells like a computer.",
  "People think.....\nI'm skinny, but I'm really chunky.\nI'm cheap, but I'm really thrifty.\nI'm blonde, but I'm really a brunette.\nI'm nosey, but I'm really curious.",
  "A joke is a very serious thing.",
  "Quantity is what you count, quality is what you count on.",
  "Store front sign: Entire store on sale, everything $1 or more.",
  "I'm trying to think how I can think of what I want to think.",
  "If you have an issue, get a tissue.",
  "Drinking after work is fine, but if you really want to enjoy working then drink before work.",
  "Duct tape is like the force. It has a light side, a dark side, and it holds the world together.",
  "An expert is a person who has made every possible mistake in a small field of study.",
  "I get enough exercise just by pushing my luck!",
  "It's simple, if it jiggles, it's fat.",
  "When I read about the evils of drinking, I gave up reading.",
  "According to Archimedes' principle, what happens when you jump in a bathtub full of water?  Answer: The phone rings.",
  "When life gives you lemons, follow the five-step plan:\n1.Sit on the couch.\n2.Turn on the TV.\n3.Throw lemons at life.\n4.Force life to make lemonade for you.\n5.Drink the lemonade.",
  "I now pronounce you man and wife, you may now change your Facebook status.",
  "When I tried to do a search for marital advise on Google, it tried to finish my sentence for me, just like my wife does.",
  "Gravitation can not be held responsible for people falling in love.",
  "Ultimate lazy moment: Watching the sunrise on TV because you're too lazy to get up and watch it for real.",
  "Hate your job? Join our support group! It’s called EVERYBODY. We meet at the bar.",
  "I'm so sorry about what I said when I was hungry.",
  "Some cause happiness wherever they go; others whenever they go.",
  "If everyone knew what I was thinking, I would get punched in the face a lot.",
  "The only way to keep your health is to eat what you don't want, drink what you don't like, and do what you'd rather not.",
  "The best part of going to work is coming back home at the end of the day.",
  "Don't be stupid, it might make you famous.",
  "What are the three words guaranteed to humiliate men everywhere?'Hold my purse.'",
  "What great energy, intelligence, and magnificent beautiful eyes... But enough about me, how are you doing?",
  "What do you mean, my birth certificate expired?",
  "When I was small I thought money and fame brought all the happiness in the world.  Now that I'm grown up, I know I was right.",
  "All of us have moments in our lives that test our courage. Taking children into a house with a white carpet is one of them.",
  "Math is fun, it teaches you life and death information, like when you're cold, you should go to a corner since it's 90 degrees there.",
  "I don't work on weekends, or any other day that ends with \"Y\".",
  "Education is what remains after one has forgotten everything he learned in school.",
  "Smartness runs in my family.  When I went to school I was so smart my teacher was in my class for five years.",
  "Newspaper Ad: Parachute for sale, used once, never opened!!",
  "Your mind needs exercise just as much as your body does, that's why I think of jogging every day.",
  "I finally found a doctor with a lot patients, and he didn't have any patience to listen to me.",
  "Gene Police: You!! Out Of The Pool!",
  "What's the best thing to do if you want to keep your hair when it starts falling out?  Put it in a box.",
  "I think it is good that books still exist, but they do make me sleepy.",
  "Karate is a form of martial arts in which people who have had years and years of training can, using only their hands and feet, make some of the worst movies in the history of the world.",
  "Worst excuse for not turning in homework: I couldn't find anyone to copy it from.",
  "Ideas don't stay in some minds very long because they don't like solitary confinement.",
  "That is the saving grace of humor, if you fail no one is laughing at you.",
  "Why did the blondes search all over a forest full of pine trees and were not able to find one single tree to use as a Christmas tree?  None of them had globes and a star on top.",
  "How do you stop a cat from scratching your furniture?  Give her scratch and win lotto tickets.",
  "I was walking down the street wearing glasses when the prescription ran out.",
  "A horse is dangerous at both ends, and uncomfortable in the middle.",
  "Microsoft: \"You've got questions. We've got dancing paperclips.",
  "It's easy to stop smoking.  I stopped smoking today with no problems.  I also stopped yesterday too, and the day before that.",
  "Beware of computer programmers that carry screwdrivers.",
  "Every time you make a typo the errorists win.",
  "I wake up looking better every day, but today I'm exaggerating.",
  "If I spit, they will take my spit and frame it as great art.",
  "Camping is nature's way of promoting the motel business.",
  "Failure is not an option -- it comes bundled with Windows.",
  "Never let a fool kiss you, or a kiss fool you.",
  "There are no stupid questions, just stupid people.",
  "If you don't succeed at first, hide all evidence that you tried.",
  "Cleaning the house while your kids are still home is like shoveling while it's still snowing.",
  "The hardest part of trying to steal one sheep is stopping the rest of them from following.",
  "He who wakes up early, yawns all day long.",
  "My wallet is like an onion, opening it makes me cry.",
  "Relationships these days start by pressing LIKE on her photo.",
  "He who laughs last didn't get it.",
  "If you die in an elevator, be sure to push the Up button.",
  "What is the best thing to do when you have a hole in a boat and water is leaking inside? Make another hole to drain the water.",
  "Working in a team means spending half your time convincing the others that your idea is better than theirs.",
  "The best advise I have for all my teachers during a test is to pass the test out as fast as possible before I forget everything.",
  "Never test how deep the water is with both feet.",
  "I'm not here to judge, I'm just pointing out all the mistakes you're making.",
  "Always remember you're unique, just like everyone else.",
  "The man who smiles when things go wrong has thought of someone to blame it on.",
  "When you see a married couple walking down the street, the one that's a few steps ahead is the one that's mad.",
  "When I was in high school I had two favorite subjects, lunch and recess.",
  "I don't need a psychiatrist to prod into my personal life and make me tell them all my secrets, I have my friends for that.",
  "The difference between running and walking is a lot more apparent when you have to go to the bathroom.",
  "I don't understand what's bothering you honey, I bring you coffee in bed every morning, all you have to do is grind it.",
  "Don't press your luck, you might pop it.",
  "Three monkeys escaped from the zoo, one was caught watching TV, the other playing hockey, and the third one was caught reading this quote!",
  "You know the speed of light; so what is the speed of dark?",
  "I always help my wife out with housework such as washing the dishes and doing the laundry.  She washes them, and I let them dry.",
  "After a while, I eventually fell in love and there was nobody to pick me up.",
  "I am not a vegetarian because I love animals; I am a vegetarian because I hate plants.",
  "What you call dog with no legs?Don't matter what you call him, he ain't gonna come.",
  "Why do gorillas have big nostrils?  Because they have thick fingers.",
  "Today was once tomorrow, and tomorrow will be today soon.",
  "I started thinking about the dangers of drinking on new year's eve.  After that, I decided to stop thinking.",
  "I'm looking to buy a new boomerang, how can I throw the old one out?",
  "My doctor prescribed laughter as the most efficient medicine, unfortunately the pharmacist said too many people were crying from laughter so it's no longer available.",
  "You already know something you don't even know that you know.",
  "Marriage is give and take. You'd better give it to her or she'll take it anyway.",
  "Newspaper Ad. For sale: Encyclopedia Britannica, complete set of 45 volumes.  No longer needed due to getting married.  My wife knows everything.  $200 Or best offer.",
  "Being a couch potato is dangerous, someone may get hungry and eat you!",
  "To be a good hunter you need good eyes, a steady hand, and a loud voice so you can yell for help when you're in a tree top.",
  "Stop!  You're under arrest for being too sexy.  Your sentence is an eternity inside my heart.",
  "I have opinions of my own -- strong opinions -- but I don't always agree with them.",
  "Gravity is a contributing factor in nearly 73 percent of all accidents involving falling objects.",
  "Facebook status: I'm not online, it's just an optical illusion.",
  "Why didn't Bruce Willis play the lead role in Titanic? He would have saved everyone.",
  "Marriage is a wonderful institution... but who wants to live in an institution?",
  "Guys: No Shirt, No Service - Gals: No Shirt, No Charge",
  "Everyone needs to believe in something. I believe I'll have another beer.",
  "Man invented language to satisfy his deep need to complain.",
  "I think I've discovered the secret of life, you just hang around until you get used to it.",
  "In my house dirty dishes are like rabbits, they keep multiplying.",
  "For this New Year's day, weather forecasters are warning of an incoming storm of hugs and kisses all over the planet... we advise closing your umbrella and opening your heart.",
  "Keep your eyes wide open before marriage, half shut afterwards.",
  "An adult is a person who no longer grows in height, but instead grows in length and width.",
  "There is no better moment to postpone something you don't want to do other than right now.",
  "New year resolutions you can actually keep!\nSkip more classes in school.\nCall in sick at work more.\nGo shopping more often.\nEat more unhealthy food like fries and burgers.\nDrink more pop cans instead of freshly squeezing healthy fruits.\nDo less exercise and watch more TV.",
  "When someone doesn't like something, it's often because they're not familiar with it, or they're too familiar with it.",
  "If I could be a bird, I'd be a Flying Purple People Eater because then people would sing about me and I could fly down and eat them because I hate that song.",
  "Whether you give a crap or don't give a crap, nobody wants crap anyway!",
  "I have the worlds largest seashell collection. You may have seen it, I keep it spread out on beaches all over the world.",
  "If you eat in the kitchen, your room is always clean, and you go to sleep at 9 o'clock, it means you don't have Internet!!",
  "So much for trusting the Mayan Calendar.  New Year resolution:  Use my cell phone calendar! Happy new year 2013!",
  "Going on a rollercoaster was a lot like last night with my husband, slow at first going up, then way fast, a few turns and then it quickly ended.",
  "What does a blonde have to do after using the computer? Put the mouse back in the cage.",
  "Fortune cookie:  You'll have a better fortune in the next cookie.",
  "If you want a good golf swing adjust the nut at the other end of the club!",
  "Money doesn't make happiness, it buys it already made.",
  "I have a new philosophy. I'm only going to dread one day at a time.",
  "Who are you and how did you get in here? Frank: I'm a locksmith. And... I'm a locksmith...",
  "Oh yeah, what are you gonna do? Release the dogs?  Or the bees?  Or the dogs with bees in their mouth and when they bark they shoot bees at you? - Homer Simpson",
  "Is it good if a vacuum really sucks?",
  "Someone told me you are the worst kisser in the world... want to show me it's not true?",
  "Men should be like Kleenex, soft, strong and disposable.",
  "The luck of having talent is not enough; one must also have a talent for luck.",
  "Behold the flying elephant, one day it flies and one day it doesn't... today it doesn't.",
  "When we go to seafood restaurants I tell them 'Just water for me, thanks.' - Fish",
  "Sports top moment: to score a goal but miss in the re-play.",
  "Rudeness top moment: to scare an ostrich on an asphalt street.",
  "It is impossible to travel faster than the speed of light, and certainly not desirable, as one's hat keeps blowing off.",
  "Genius without education is like silver in the mine.",
  "Think you're smart?  Come over and help me with my homework.",
  "It was not that Adam ate the apple for the apple's sake, but because it was forbidden. It would have been better for us--oh infinitely better for us--if the serpent had been forbidden.",
  "Christmas is the time when you buy presents with the money from next year.",
  "I watched a black and white TV for so long, so when I got a color TV I picked the red one.",
  "I got some new underwear the other day. Well, new to me.",
  "Do you want to feel the breath of one near you?  Do you want to feel them touching you and petting you?  Take public transit.",
  "Note - The key to a good relationship is the key. Give me back the key.",
  "Don't wake me up! I'm studying.",
  "At the zoo, all the animals have a decent composure, except for the monkeys. You get the feeling man is very close to them.",
  "Egotist: a person more interested in himself than in me.",
  "Beauty is mysterious as well as terrible.",
  "I caught the worm thief - it was a fish.",
  "You tried your best and you failed miserably. The lesson is 'never try'.",
  "There are three sides to an argument - your side, my side and the right side.",
  "If you don't like your job, you don't strike! You just go in every day, and do it really half assed. That's the American way. - Homer Simpson",
  "I used to work in a fire hydrant factory. You couldn't park anywhere near the place.",
  "Painting: The art of protecting flat surfaces from the weather and exposing them to the critic.",
  "If you're a fish swimming against the current, you will soon be electrocuted.",
  "Son, employees are like mules. Some you stand in front of and coax them along with a carrot. Some you stand behind and kick them in the ass. The key to managemeant is knowing which mules are which.",
  "Newspaper Ad: Snowblower for sale, only used on snowy days.",
  "Home computers are being called upon to perform many new functions, including the consumption of homework formerly eaten by the dog.",
  "If a philosopher answers your question, you will no longer understand what you asked in the first place.",
  "A computer once beat me at chess, but it was no match for me at kick boxing.",
  "Stupidity is far more fascinating than intelligence, after all intelligence has it's limits.",
  "Me and my wife lived happily for twenty years.... then we met.",
  "Never go to a doctor whose office plants have died.",
  "I didn't find out what happiness means until I got married... and then it was too late.",
  "Did you ever notice, whenever you need your keys the most, that's when they're the hardest to find?",
  "The most fun things in life are either immoral, illegal or they make you fat.",
  "Son, if you really want something in this life, you have to work for it. Now quiet! They're about to announce the lottery numbers.",
  "Getting on a plane, I told the ticket lady, 'Send one of my bags to New York, one to Los Angeles, and one to Miami.' She said, 'We can't do that!' I told her, 'You did it last week!'",
  "When I die, I want to go peacefully like my Grandfather did, in his sleep - not screaming, like the passengers in his car.",
  "Remember: Don't Insult the Alligator till after you cross the river.",
  "It's really complicated to make something simple, but very simple to make something something complicated.",
  "Due to current economic conditions the light \nat the end of the tunnel has been turned off.",
  "The richer you get, the more expensive happiness becomes.",
  "I wish that all of my enemies had three cars parked in front of their house.  An ambulance, fire truck and police car.",
  "Your legs must be tired because you have been running through my mind all night.",
  "How many roads must a man walk down before he admits he's lost?",
  "You never run out of things that can go wrong.",
  "If life is not smiling at you, give it a good tickling.",
  "Be yourself; everyone else is already taken.",
  "A stupid person laughs three times at a joke; once when everyone else is laughing, a second time when he actually gets the joke, and a third time when he realizes he was laughing without getting the joke at first.",
  "If you didn't see it with your own eyes, or hear it with your own ears, don't invent it with your small mind and share it with your big mouth!",
  "They say that love is more important than money, but have you ever tried to pay your bills with a hug?",
  "Have you ever noticed that anybody driving slower than you is an idiot, and anyone going faster than you is a maniac?",
  "When I stare at the sky, I see you.  When I stare out into the ocean, I see you.  When I'm looking at the moon, I see you.  Geez! Would you move aside, you're constantly getting in my way!",
  "The broccoli says 'I look like a small tree', the mushroom says 'I look like an umbrella', the walnut says 'I look like a brain', and the banana says 'Can we please change the subject?'",
  "When you wake up at 6 in the morning, you close your eyes for 5 minutes and it's already 6:45.  When you're at work and it's 2:30, you close your eyes for 5 minutes and it's 2:31.",
  "Who says nothing is impossible? I've been doing nothing for years.",
  "The ideal man doesn't smoke, doesn't drink, doesn't do drugs, doesn't swear, doesn't get angry, doesn't exist.",
  "I love everyone!  I love to be around some people, I love to stay away from others, and some I'd just love to punch right in the face!",
  "The great pleasure in life is doing what people say you cannot do.",
  "It's not important to win, it's important to make the other guy lose.",
  "People say you can't live without love, but I think oxygen is more important.",
  "I did not trip and fall.  I attacked the floor and I believe I am winning.",
  "Everybody wants to go to heaven; but nobody wants to die.",
  "Studying means 10% reading and 90% complaining to your friends that you have to study.",
  "Laughter is like a windshield wiper, it doesn't stop the rain but allows us to keep going.",
  "It's so simple to be wise. Just think of something stupid to say and then don't say it.",
  "If you think your boss is stupid, remember: you wouldn't have a job if he was any smarter.",
  "Girls are like phones.  We love to be held and talked to, but if you press the wrong button you'll be disconnected!",
  "Doing nothing is hard, you never know when you're done.",
  "I always try to cheer myself up by singing when I get sad.  Most of the time, it turns out that my voice is worse than my problems.",
  "God please give me patience, if you give me strength I will just punch them in the face.",
  "When I said that I cleaned my room, I just meant I made a path from the doorway to my bed.",
  "In the morning I can't eat, I'm thinking of you.  In the evening I can't eat, I'm thinking of you.  In the night I can't sleep.. I'm so hungry!",
  "I dream of a better tomorrow, where chickens can cross the road and not be questioned about their motives.",
  "I consider myself a crayon, I might not be your favorite color but one day you'll need me to complete your picture.",
  "You know you are getting old when the candles on your birthday cake start to cost more than the cake itself.",
  "Do you believe in love at first sight, or should I walk by again?",
  "How can you make sure you never miss your target? Shoot first, and whatever you hit, call it the target.",
  "A mind is like a parachute. It doesn't work if it is not open.",
  "I know the voices in my head aren't real..... but sometimes their ideas are just absolutely awesome!",
  "What I do when I see someone pretty is, I stare, I smile then when I get tired I put the mirror down.",
  "Life isn't measured by the number of breaths you take, but by the number of moments that take your breath away.",
  "Some people walk into our lives and leave footprints on our hearts. Others walk into our lives and we want to leave footprints on their face!",
  "When my boss asked me who is the stupid one, me or him? I told him everyone knows he doesn't hire stupid people.",
  "I'm not lazy, I'm just very relaxed.",
  "When a door closes another door should open, but if it doesn't then go in through the window.",
  "I hate it when people see me at the supermarket and they're like 'Hey, what are you doing here?'  I tell them 'You know.. hunting elephants.'",
  "Zoning out is your brain's way of saying \"You look bored. Let me take you to a better place.\"",
  "The secret to happiness is not to do what makes you happy, it's to be happy doing what you're already doing.",
  "What does a blonde ask her blonde friend who just did a pregnancy test?  Were the questions hard? Did you pass?",
  "After a lot of research, scientists have concluded that the most vitamins are found in the pharmacy.",
  "Newspaper Ad. FREE PUPPIES: Half cocker spaniel, half sneaky neighbors dog.",
  "There was a robot invented in China that catches thieves.  In Australia it caught 10 thieves, in America it caught 100, in France 1000, and in Romania, somebody stole the robot.",
  "I'm not afraid of flying, I'm afraid of not flying.",
  "Give a man a fish and he will have food for one day.  Teach him to catch fish and he will spend all day at the lake drinking beer.",
  "Most of us don't realize it, but we're all part of something much bigger than ourselves, and we're all connected in some way, not just through Facebook.",
  "If you hold a cat by the tail you learn things you cannot learn any other way.",
  "My advice to you is get married: if you find a good wife you'll be happy; if not, you'll become a philosopher.",
  "When is yelling during a robbery a bad idea?  When you have gold teeth.",
  "I'm not afraid of death; I just don't want to be there when it happens.",
  "Behind every successful man is a surprised woman.",
  "Those who think they know it all are very annoying to those of us who actually do.",
  "When my boss told me this is the fifth time I'm late, I smiled and thought to myself, it's Friday!!",
  "If love is blind, why is lingerie so popular?",
  "Some days, you're the pigeon, some days you're the statue, just live with it.",
  "In my house I'm the boss, my wife is just the decision maker.",
  "When a man gets close to a woman wearing a leather mini-skirt, his heart starts beating faster, his throat gets dry, his knees get weak and he becomes irrational.. Why? Because the leather smells like a new car.",
  "A glass of beer shortens your life by one minute, a glass of wine by two minutes, and a day of work by seven to ten hours.",
  "If Barbie is so popular, why do you have to buy her friends?",
  "If I don't log into Facebook two days in a row, call the police, someone must've kidnapped me!",
  "If what you've done is stupid but it works, then it really isn't that stupid at all.",
  "If there is a wrong way to do something, then someone will do it.",
  "The odds of going to the store for a loaf of bread and coming out with ONLY a loaf of bread are three billion to one.",
  "There's nothing better than a good friend, except for a good friend with chocolate.",
  "A clear conscience is the sure sign of a bad memory.",
  "After (M)onday and (T)uesday comes WTF !",
  "Energizer Bunny arrested, charged with battery.",
  "I lost my teddy bear, can I sleep with you?",
  "I think I'm starting to have a problem with my vision, ever since I got married I haven't seen any money through the entire house.",
  "When there's a will, I want to be in it.",
  "When I was kidnapped, my parents snapped into action. They rented out my room.",
  "A cookie a day keeps the sadness away.  An entire jar of cookies a day brings it back.",
  "Intelligence is chasing me, but I'm beating it so far.",
  "The only thing that interferes with my learning is my education.",
  "Hard work never killed anybody, but why take a chance?",
  "When the cop told me to give him my first name and last name I told him, 'Are you crazy?  What's my name going to be then?'",
  "Growing up is amazing, until you get old!",
  "Why do nerds confuse Halloween and Christmas? Because OCT31=DEC25.",
  "What does the computer programmer say to his fellow programmer when he asks him to borrow $1000?  I'll give you 1024 to make it even.",
  "The stick is sticky.",
  "Unger, didn't you serve under Oveur in the Air Force?",
  "There are worse things in life than death. Have you ever spent an evening with an insurance salesman?",
  "The best way to show a giraffe your love is to knit a scarf for it.",
  "No, please don't eat me. I have a wife and kids,eat them. - Homer Simpson",
  "I'm going to open a new Facebook account named 'Anonymous' so all the cool quotes will be attributed to me!",
  "If I keep paying attention, I'm going to be in debt!",
  "The decision to decide is a decision in itself.",
  "Insurance is like marriage. You pay, pay, pay, and you never get anything back.",
  "Why is the sky blue?  Sure there is an explanation, but lets just be thankful it's not red!",
  "I'm sorry officer but I can't stop speeding... the earth is spinning way over the speed limit in this zone.",
  "I follow a rigorous exercise routine that I never get lazy about; fetching beer bottles from the fridge.",
  "Nine out of ten people love chocolate, and the 10th person is always lying.",
  "When you want something really bad, crying for it isn't going to work nearly as good as complaining!",
  "Fall is my favorite season in Los Angeles, watching the birds change color and fall from the trees",
  "If you had to identify in one word the reason why the human race has not achieved and never will achieve its full potential, that word would be 'meetings.'",
  "Whenever I think of the past, it brings back so many memories...",
  "Studying top moment: to exercise your memory and start sweating.",
  "But doctor, where is the umbilical cord?  New technology, it's wireless.",
  "In life, we must find happiness.  I've been looking everywhere and still haven't found it.",
  "When I first saw Batman, I was expecting to see a baseball movie.",
  "Why was the rabbit chasing the frog?  Because the frog kept calling out \"riaabit.. riabbit..\"",
  "I changed my password everywhere to 'incorrect.'  That way when I forget it, it always reminds me, 'Your password is incorrect.'",
  "Some people are like clouds. When they go away, it's a brighter day.",
  "A best friend is like a four leaf clover, hard to find, lucky to have.",
  "You love flowers, but you cut them.  You love animals, but you eat them.  You tell me you love me, so now I'm scared!",
  "When you fall, I will be there to catch you - With love, the floor.",
  "I don't need a hair stylist, my pillow gives me a new hairstyle every morning.",
  "When the past comes knocking, don't answer.  It has nothing new to tell you.",
  "Don't worry if plan A fails, there are 25 more letters in the alphabet.",
  "Dear Math, please grow up and solve your own problems, I'm tired of solving them for you.",
  "Don't know where your kids are in the house?  Turn off the internet and they'll show up quickly.",
  "If people are talking behind your back, be happy that you are the one in front.",
  "I feel sorry for people who don't have dogs. I hear they have to pick up food they drop on the floor.",
  "Most of the time... when you're crying, nobody notices your tears.\nMost of the time... when you're worried, nobody feels your pain.\nMost of the time... when you're happy, nobody sees your smile.\nBut when you fart just one time...",
  "Life doesn't have any hands, but it can sure give you a slap sometimes.",
  "I'm not clumsy! The floor just hates me, the table and chairs are bullies, and the walls get in my way.",
  "In the morning you beg to sleep more, in the afternoon you are dying to sleep, and at night you refuse to sleep.",
  "You can trust your dog to guard your house but never trust your dog to guard your sandwich.",
  "Some relationships are like Tom and Jerry, they argue and disagree all the time, but they still can't live without each other.",
  "All my life I thought air was free, until I bought a bag of chips.",
  "No matter how smart you are you can never convince someone stupid that they are stupid.",
  "Retirement is great, you get to be your own boss and tell yourself to do nothing all day.",
  "Some minds are like concrete, thoroughly mixed and permanently set.",
  "I stretch my arms, I bend my knees, I straighten my neck, and they are all crunching.  Conclusion: I'm not getting older, I'm getting more crunchy.",
  "Why can't cats work on the computer?  They get too distracted chasing the mouse around.",
  "When is the longer way always better than the shorter one?  When you're a taxi driver.",
  "There are more important things in life than Facebook and Twitter,.. like watching TV, and having a beer.",
  "If it's the fifth day in a row that you don't feel like working, it means it's finally Friday!",
  "Cat life mice can foxes be wolves boring frogs but grasshopper let's swan love it cow anyhow.  Now read it again without the animals.",
  "The last thing that blew my mind was the wind.",
  "If there's no love in the world,... let's make some.",
  "Don't drink to forget me, you'll end up seeing me double.",
  "A text message can lead to a date, which can lead to a kiss, and a wonderful night together.  Will you text me?",
  "You can talk to yourself and you can answer yourself, but if feel the need to pardon yourself, that's when you know something's wrong.",
  "I always intended to pay for my sins, but I could never afford it.",
  "How does the healthy dog bark? Ruff Ruff. \nHow does the cold dog bark ?  Scarf Scarf. \nHow does the confused dog bark?  Wutf? Wutf?",
  "What animal can jump higher than a house?  Any animal that can jump at all, because houses can't jump.",
  "Time is a great teacher, but unfortunately it kills all its pupils.",
  "Honesty top moment: to be a cop and give yourself a ticket for going through a red light.",
  "One of the great things about books is sometimes there are some fantastic pictures.",
  "I find television very educating. Every time somebody turns on the set, I go into the other room and read a book.",
  "Store sign: Why go somewhere else and waste your money?  Come here!",
  "All generalizations are false, including this one.",
  "The amount of time it takes for a minute to go by is proportionally dependent with the distance to the bathroom door.",
  "\"Oh you want to have your cake and eat it too?\" Darn right, what good is cake if you can't eat it ?",
  "He who laughs.....lasts.",
  "The past can haunt you, but so can ghosts.  The future can be unpredictable, but so can the stock market.  So the lesson is, don't worry about ghosts and the stock market and you will be fine.",
  "I tried taking everything in life with a grain of salt, but after using up two bags of salt I gave up.",
  "If there is a \"WILL\", there are 500 relatives.",
  "My wife asked me what numbers to play at the lottery.  I told her 'the winning ones!'",
  "Why are you waiting so long to report your stolen car to the police?  I'm giving them time to fix it.",
  "I can make the doorbell ring any time I want, all I have to do is go to the bathroom.",
  "The trouble with the rat race is that even if you win, you're still a rat.",
  "How does a doctor feel when he loses a patient in the emergency room?  The same way a child feels when he drops his ice cream.",
  "When you come to a fork in the road, take it.",
  "Funny sign at health spa: Fresh 10,000 year old mud for sale.",
  "Money frees you from doing things you dislike. Since I dislike doing nearly everything, money is handy.",
  "Next week I'm going on a diet, you can buy me jewelry instead of chocolate.",
  "The only problem with golf is that the slow people are always in front of you and the fast people always end up behind you.",
  "What's the best excuse to ask the girl you like for her photo?  Tell her you're collecting all the Pokemon's.",
  "What's the difference between a cat and a flea?  Cats can have fleas, but fleas can't have cats.",
  "My wife never gives up.  She is so insistent that she entered the wrong password over and over again until she managed to convince the computer that she's right!",
  "I live my life one weekend at time, for those two days nothing else matters, I am FREE.",
  "When you're thinking that I'm thinking of you, I'm thinking you're thinking of me.",
  "It doesn't matter how low the dollar will go, I will always bend down and pick it up.",
  "He grabbed her hand and held it tightly, and she thought, \"he loves me!\"  And he thought, \"wow this sidewalk is icy!\"",
  "What are the two magic words that you can always use to make a shark happy? \"Man Overboard!\"",
  "There is a place you can touch a woman that will drive her crazy. Her heart.",
  "I never apologize. I’m sorry, but that’s just the way I am..",
  "What did the dog say after walking in the desert for hours?  If I don't find a tree soon I'm gonna pee on myself.",
  "What's happening with your phone, every time I call you it says 'The subscriber you're calling is a monkey, please contact the zoo.'",
  "Officer: I had a feeling I'd catch someone speeding here.  Driver: I know, that's why I came as fast as I could!",
  "24 hours in a day, 24 beers in a case. Coincidence?",
  "Why do you always see lightning first and hear the thunder later?  Because your eyes are in front of your ears.",
  "Everyone wants your happiness.  Don't let them take it!!",
  "The worst thing I can be is the same as everybody else. I hate that.",
  "My wife dresses to kill. She cooks the same way.",
  "Let's have a beer together, you can open it and I will drink it.",
  "They say money doesn't bring happiness, but everyone still wants to prove it for themselves.",
  "It's true that we don't know what we've got until we lose it, but it's also true that we don't know what we've been missing until it arrives.",
  "If your wife wants to learn to drive, don't stand in her way."
]
